In [1]:
import numpy as np
import pandas as pd

## Pandas utility functions

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

In [6]:
pd.notnull(None)

False

In [7]:
pd.notna(None)

False

In [8]:
pd.notnull(3)

True

In [9]:
pd.isnull(pd.Series([1, None,7]))

0    False
1     True
2    False
dtype: bool

In [11]:
pd.isnull(pd.DataFrame({'A':[1, None,7], 'B':[None, 2, 3], 'C':[None, None, None]}))

       A      B     C
0  False   True  True
1   True  False  True
2  False  False  True

## Pandas Operations with Missing Values

In [12]:
pd.Series([1,2,np.nan]).count()

2

In [13]:
pd.Series([1,2,np.nan]).sum()

3.0

In [14]:
pd.Series([1,2,np.nan]).mean()

1.5

## Filtering missing data

In [15]:
s = pd.Series([1,2,3,np.nan,np.nan,4])

In [16]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [18]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [19]:
pd.isnull(s).sum()

2

In [20]:
pd.notnull(s).sum()

4

In [21]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [22]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [23]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

## Dropping null values

In [24]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [25]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

## Dropping null values on DataFrames

In [27]:
df = pd.DataFrame({'A':[1,np.nan,30,np.nan],
                  'B':[2,8,31,np.nan],
                  'C':[np.nan,9,32,100],
                  'D':[5,8,34,110]})

In [28]:
df

      A     B      C    D
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [30]:
df.isnull()

       A      B      C      D
0  False  False   True  False
1   True  False  False  False
2  False  False  False  False
3   True   True  False  False

In [31]:
df.isnull().sum()

A    2
B    1
C    1
D    0
dtype: int64

In [32]:
df.dropna()

      A     B     C   D
2  30.0  31.0  32.0  34

In [33]:
df.dropna(axis=1)

     D
0    5
1    8
2   34
3  110

In [34]:
df.dropna(how='all')

      A     B      C    D
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [35]:
df.dropna(how='any')

      A     B     C   D
2  30.0  31.0  32.0  34

use the thresh paramater to indicate a threshold of non-null values

In [36]:
df.dropna(thresh=3)

      A     B     C   D
0   1.0   2.0   NaN   5
1   NaN   8.0   9.0   8
2  30.0  31.0  32.0  34

In [38]:
df.dropna(thresh=3, axis='columns')

      B      C    D
0   2.0    NaN    5
1   8.0    9.0    8
2  31.0   32.0   34
3   NaN  100.0  110

## Filling null values

In [40]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [41]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [42]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [43]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [44]:
df.fillna(method='bfill')

      A     B      C    D
0   1.0   2.0    9.0    5
1  30.0   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [45]:
df.fillna(method='ffill', axis=0)

      A     B      C    D
0   1.0   2.0    NaN    5
1   1.0   8.0    9.0    8
2  30.0  31.0   32.0   34
3  30.0  31.0  100.0  110

In [46]:
df.fillna(method='ffill', axis=1)

      A     B      C      D
0   1.0   2.0    2.0    5.0
1   NaN   8.0    9.0    8.0
2  30.0  31.0   32.0   34.0
3   NaN   NaN  100.0  110.0

## Checking if there are NAs

In [47]:
s.dropna().count()

4

In [48]:
missing_values = len(s.dropna())!=len(s)

In [49]:
missing_values

True

In [50]:
pd.Series([True, False, False]).any()

True

In [51]:
pd.Series([True, False, False]).all()

False

In [52]:
pd.Series([True, True, True]).all()

True

In [53]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [54]:
pd.Series([1, np.nan]).isnull().any()

True

In [55]:
pd.Series([1,2]).isnull().any()

False

In [56]:
s.isnull().any()

True

In [57]:
s.isnull().values

array([False, False, False,  True,  True, False])

In [58]:
s.isnull().values.any()

True